recept/src/DataProcessors/ЗагрузкаОстатков/ЗагрузкаОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаОстатков</name>
  <attributes>
    <name>ФайлЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

recept/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ВыпускПродукции</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/Enums/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЕдиницыИзмерения</name>
  <enumValues>
    <name>Литр</name>
  </enumValues>
  <enumValues>
    <name>Килограмм</name>
  </enumValues>
  <enumValues>
    <name>Штука</name>
  </enumValues>
  <enumValues>
    <name>услуга</name>
  </enumValues>
</mdclass:Enum>

recept/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
  <enumValues>
    <name>УслугаРазделитель</name>
  </enumValues>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
</mdclass:Enum>

recept/src/Documents/КоррекцияОстатков/КоррекцияОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КоррекцияОстатков</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коррекция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/Catalogs/НоменклатураМатериалы/НоменклатураМатериалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураМатериалы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Архив</name>
      <description>Архив</description>
    </items>
    <items>
      <name>Продукция</name>
      <description>Продукция</description>
    </items>
    <items>
      <name>Сырье</name>
      <description>Сырье</description>
    </items>
    <items>
      <name>z_Архив</name>
      <description>Z архив</description>
    </items>
  </predefined>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСырья</name>
    <type>
      <types>EnumRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>CatalogRef.Цвет</types>
    </type>
  </attributes>
  <attributes>
    <name>RAL</name>
    <type>
      <types>CatalogRef.RAL</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>CatalogRef.Фасовка</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестоХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вязкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перетир</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикиНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

recept/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.НоменклатураМатериалы</owners>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>CatalogRef.Цвет</types>
    </type>
  </attributes>
  <attributes>
    <name>RAL</name>
    <type>
      <types>CatalogRef.RAL</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>CatalogRef.Фасовка</types>
    </type>
  </attributes>
</mdclass:Catalog>

recept/src/DataProcessors/ЗагрузкаОстатков/Forms/Форма/Module.bsl
#Область Удаление

&НаСервере
Функция ОчиститьОстаткиПоПродукцииНаСервере()
	
	СчетчикСтрок = 0;
	
	// 1. Ищем папку Продукция в правильном справочнике
	ПапкаПродукция = Справочники.НоменклатураМатериалы.НайтиПоНаименованию("Продукция", Истина);
	
	Если ПапкаПродукция.Пустая() Тогда
		Сообщить("Папка 'Продукция' не найдена. Подготовка документа невозможна.");
		Возврат 0;
	КонецЕсли;

	// 2. Получаем текущие остатки по регистру
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиМатериаловОстатки.Наименование КАК НоменклатураСсылка,
		|	ОстаткиМатериаловОстатки.ОстатокОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиМатериалов.Остатки(, Наименование В ИЕРАРХИИ (&ПапкаПродукция)) КАК ОстаткиМатериаловОстатки";
	
	Запрос.УстановитьПараметр("ПапкаПродукция", ПапкаПродукция);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("Остатков по папке 'Продукция' не обнаружено.");
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();

	// 3. Создаем объект документа (но не проводим его)
	ДокОбъект = Документы.КоррекцияОстатков.СоздатьДокумент();
	ДокОбъект.Дата = ТекущаяДата();
	ДокОбъект.Комментарий = "Заполнение остатками из папки Продукция для последующей очистки";
	
	// 4. Заполняем ТАБЛИЧНУЮ ЧАСТЬ "Материалы"
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ДокОбъект.Материалы.Добавить();
		
		// Заполняем только номенклатуру (из измерения Наименование)
		НоваяСтрока.Номенклатура = Выборка.НоменклатураСсылка;
		НоваяСтрока.Коррекция = - Выборка.Количество;
		// Обычно для коррекции нужно и количество, чтобы понимать, что списывать
		//Если ОбщегоНазначения.ЕстьРеквизитТабличнойЧастиДокумента("Количество", "Материалы", Метаданные.Документы.КоррекцияОстатков) Тогда
		//	НоваяСтрока.Количество = Выборка.Количество;
		//КонецЕсли;
		
		СчетчикСтрок = СчетчикСтрок + 1;
		
	КонецЦикла;

	// 5. Записываем документ БЕЗ ПРОВЕДЕНИЯ
	Попытка
		// РежимЗаписиДокумента.Запись — это просто сохранение черновика
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("Создан черновик документа: " + Строка(ДокОбъект.Ссылка));
	Исключение
		Сообщить("Не удалось записать документ: " + ОписаниеОшибки());
		Возврат 0;
	КонецПопытки;

	Возврат СчетчикСтрок;

КонецФункции

&НаКлиенте
Процедура ОчиститьОстаткиПоПродукции(Команда)
	ОчиститьОстаткиПоПродукцииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УдалениеПродукцииВАрхив(Команда)
	ТекстВопроса = "ВНИМАНИЕ! Вся номенклатура будет перемещена в папку ""Архив"" и помечена на удаление. Продолжить?";
	
	Оповещение = Новый ОписаниеОповещения("ПереместитьВсеВАрхивЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВсеВАрхивЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработанноеКоличество = ПереместитьИзПродукцииВАрхивНаСервере();
		ПоказатьОповещениеПользователя("Готово", , "Перемещено и помечено элементов: " + Строка(ОбработанноеКоличество));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПереместитьИзПродукцииВАрхивНаСервере()
	
	Счетчик = 0;
	
	// 1. Получаем ссылку на предопределенную папку Архив
	ПапкаАрхив = Справочники.НоменклатураМатериалы.Архив;
	
	// 2. Ищем папку Продукция
	ПапкаПродукция = Справочники.НоменклатураМатериалы.НайтиПоНаименованию("Продукция", Истина);
	
	Если ПапкаПродукция.Пустая() Тогда
		Сообщить("Папка 'Продукция' не найдена в справочнике!");
		Возврат 0;
	КонецЕсли;
	
	// 3. Выбираем все элементы, которые находятся ВНУТРИ Продукции
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураМатериалы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НоменклатураМатериалы КАК НоменклатураМатериалы
		|ГДЕ
		|	НоменклатураМатериалы.ЭтоГруппа = ЛОЖЬ
		|	И НоменклатураМатериалы.Родитель В ИЕРАРХИИ(&ПапкаПродукция)";
		
	Запрос.УстановитьПараметр("ПапкаПродукция", ПапкаПродукция);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	Попытка
		Пока Выборка.Следующий() Цикл
			
			ОбъектНоменклатуры = Выборка.Ссылка.ПолучитьОбъект();
			
			// Устанавливаем нового родителя и пометку
			ОбъектНоменклатуры.Родитель = ПапкаАрхив;
			ОбъектНоменклатуры.ПометкаУдаления = Истина;
			
			// Записываем без проверок (РежимЗаписи.Запись), чтобы обойти возможные блокировки логики
			ОбъектНоменклатуры.Записать();
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Сообщить("Произошла ошибка: " + ОписаниеОшибки());
		Возврат 0;
	КонецПопытки;
	
	Возврат Счетчик;
	
КонецФункции

#КонецОбласти





#Область СозданиеСправочников

&НаСервере
Процедура СинхронизироватьНСИНаСервере()  
	
    ПапкаПродукция = Справочники.НоменклатураМатериалы.Продукция;
    ЕдиницаКГ = Перечисления.ЕдиницыИзмерения.Килограмм;
    КэшНоменклатуры = Новый Соответствие;
    
    НачатьТранзакцию();
    
    Попытка
        Для Каждого Стр Из Реквизит1 Цикл  
            
            // 1. Сначала всегда находим/создаем базовый Товар
            НаименованиеБазовое = СокрЛП(Стр.Номенклатура);
            Если ПустаяСтрока(НаименованиеБазовое) Тогда Продолжить; КонецЕсли;

            СсылкаНаТовар = КэшНоменклатуры.Получить(НаименованиеБазовое);
            Если СсылкаНаТовар = Неопределено Тогда
                СсылкаНаТовар = Справочники.НоменклатураМатериалы.НайтиПоНаименованию(НаименованиеБазовое, Истина, ПапкаПродукция);
                
                Если СсылкаНаТовар.Пустая() Тогда
                    НовЭлемент = Справочники.НоменклатураМатериалы.СоздатьЭлемент();
                    НовЭлемент.Наименование          = НаименованиеБазовое;
                    НовЭлемент.Родитель              = ПапкаПродукция;
                    НовЭлемент.ЕдиницаИзмеренияСырья  = ЕдиницаКГ;
                    НовЭлемент.ТипНоменклатуры       = Перечисления.ТипыНоменклатуры.Продукция;
                    НовЭлемент.Записать();
                    СсылкаНаТовар = НовЭлемент.Ссылка;
                КонецЕсли;
                КэшНоменклатуры.Вставить(НаименованиеБазовое, СсылкаНаТовар);
            КонецЕсли;

            // 2. ОПРЕДЕЛЯЕМ, КТО ГЛАВНЫЙ В ЭТОЙ СТРОКЕ
            // Проверяем колонку "Комплект" (учитываем, что там может быть "Да", "1" или Истина)
            ЭтоКомплект = Ложь;
            ЗначениеКомплекта = СокрЛП(Стр.Комплект);
            Если НЕ ЗначениеЗаполнено(Стр.Комплект) Тогда    //Или ВРег(ЗначениеКомплекта) = "ДА" Или Стр.Комплект = Истина Тогда
                ЭтоКомплект = Истина;
            КонецЕсли;

            Если ЭтоКомплект Тогда
                // Работаем с комплектом
                ИмяКомплекта = НаименованиеБазовое + " (к-кт)";
                СсылкаНаКомплект = Справочники.НоменклатураМатериалы.НайтиПоНаименованию(ИмяКомплекта, Истина, ПапкаПродукция);
                
                Если СсылкаНаКомплект.Пустая() Тогда
                    НовКомплект = Справочники.НоменклатураМатериалы.СоздатьЭлемент();
                    НовКомплект.Наименование          = ИмяКомплекта;
                    НовКомплект.Родитель              = ПапкаПродукция;
                    НовКомплект.ТипНоменклатуры       = Перечисления.ТипыНоменклатуры.Комплект;
                    НовКомплект.Записать();
                    СсылкаНаКомплект = НовКомплект.Ссылка;
                КонецЕсли;
                
                ЦелеваяНоменклатура = СсылкаНаКомплект;
            Иначе
                ЦелеваяНоменклатура = СсылкаНаТовар;
            КонецЕсли;

            // 3. СОЗДАЕМ ХАРАКТЕРИСТИКУ ИМЕННО ДЛЯ ЦЕЛЕВОГО ОБЪЕКТА
            Стр.СсылкаНоменклатура   = ЦелеваяНоменклатура;
            Стр.СсылкаХарактеристика = СоздатьИлиНайтиХарактеристику(ЦелеваяНоменклатура, Стр);
            
        КонецЦикла;
        
        ЗафиксироватьТранзакцию();
        Сообщить("Синхронизация завершена.");

    Исключение
        ОтменитьТранзакцию();
        Сообщить("Ошибка: " + ОписаниеОшибки());
    КонецПопытки;
	
КонецПроцедуры   


// Вспомогательная функция, чтобы не дублировать код для товара и комплекта
&НаСервере
Функция СоздатьИлиНайтиХарактеристику(ВладелецСсылка, ДанныеСтроки)
	
	// Очистка входных данных от лишних пробелов
	ЦветНаименование    = СокрЛП(ДанныеСтроки.Цвет);
	РАЛНаименование     = СокрЛП(ДанныеСтроки.RAL);
	УпаковкаНаименование = СокрЛП(ДанныеСтроки.Фасовка);
	
	// Собираем имя ТОЛЬКО из заполненных полей
	МассивИмен = Новый Массив;
	Если ЗначениеЗаполнено(ЦветНаименование) Тогда МассивИмен.Добавить(ЦветНаименование); КонецЕсли;
	Если ЗначениеЗаполнено(РАЛНаименование)  Тогда МассивИмен.Добавить(РАЛНаименование);  КонецЕсли;
	Если ЗначениеЗаполнено(УпаковкаНаименование) Тогда МассивИмен.Добавить(УпаковкаНаименование); КонецЕсли;
	
	НаименованиеХар = СтрСоединить(МассивИмен, ", ");
	
	Если ПустаяСтрока(НаименованиеХар) Тогда
		Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	НайденнаяХар = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(НаименованиеХар, Истина, ВладелецСсылка);
	
	Если НайденнаяХар.Пустая() Тогда
		ОбъектХар = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		ОбъектХар.Владелец     = ВладелецСсылка;
		ОбъектХар.Наименование = НаименованиеХар;
		
		// ЖЕСТКАЯ ПРОВЕРКА: Ищем ссылку только если строка не пуста. 
		Если ЗначениеЗаполнено(ЦветНаименование) Тогда
			ОбъектХар.Цвет = ПолучитьИлиСоздатьЭлементСправочника(Справочники.Цвет, ЦветНаименование);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РАЛНаименование) Тогда
			ОбъектХар.RAL = ПолучитьИлиСоздатьЭлементСправочника(Справочники.RAL, РАЛНаименование);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(УпаковкаНаименование) Тогда
			ОбъектХар.Фасовка = ПолучитьИлиСоздатьЭлементСправочника(Справочники.Фасовка, УпаковкаНаименование);
		КонецЕсли;
		
		Попытка
			ОбъектХар.Записать();
			Возврат ОбъектХар.Ссылка;
		Исключение
			Сообщить("Не удалось записать характеристику '" + НаименованиеХар + "': " + ОписаниеОшибки());
			Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Возврат НайденнаяХар;
	
КонецФункции  


// Универсальная функция-помощник для поиска и создания элементов простых справочников
&НаСервере
Функция ПолучитьИлиСоздатьЭлементСправочника(МенеджерСправочника, НаименованиеЭлемента)
	
	Если ПустаяСтрока(НаименованиеЭлемента) Тогда
		Возврат МенеджерСправочника.ПустаяСсылка();
	КонецЕсли;
	
	СсылкаНаЭлемент = МенеджерСправочника.НайтиПоНаименованию(НаименованиеЭлемента, Истина);
	
	Если СсылкаНаЭлемент.Пустая() Тогда
		Попытка
			НовыйЭлемент = МенеджерСправочника.СоздатьЭлемент();
			НовыйЭлемент.Наименование = НаименованиеЭлемента;
			НовыйЭлемент.Записать();
			Возврат НовыйЭлемент.Ссылка;
		Исключение
			Сообщить("Ошибка при создании элемента '" + НаименованиеЭлемента + "': " + ОписаниеОшибки());
			Возврат МенеджерСправочника.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	
	Возврат СсылкаНаЭлемент;
	
КонецФункции


&НаКлиенте
Процедура СинхронизацияИСозданиеСправочников(Команда)
	СинхронизироватьНСИНаСервере();
	ПоказатьОповещениеПользователя("Готово", , "Синхронизация справочников завершена");
КонецПроцедуры

#КонецОбласти




#Область СозданиеДокументов



&НаСервере
Функция СоздатьДокументыНаСервере()
	
	// 1. Проверка на заполненность обязательных данных
	Ошибок = 0;
	Для Каждого Стр Из Объект.ТаблицаЗагрузки Цикл
		Если Не ЗначениеЗаполнено(Стр.ТоварСсылка) Тогда
			Сообщить("В строке " + Стр.НомерСтроки + " не заполнена Номенклатура!");
			Ошибок = Ошибок + 1;
		КонецЕсли;
		// Если для товара обязательна партия, добавьте проверку здесь
	КонецЦикла;
	
	Если Ошибок > 0 Тогда
		Возврат Неопределено; // Прерываем создание документа
	КонецЕсли;
	
	// 2. Выгружаем данные с формы в серверную Таблицу Значений для свертки
	ТЗ = Объект.ТаблицаЗагрузки.Выгрузить();
	
	// Оставляем только нужные колонки
	ТЗ.Очистить(); // Нам нужны только данные, структуру оставляем
	ТЗ = Объект.ТаблицаЗагрузки.Выгрузить( , "ТоварСсылка, ХарСсылка, ПартияСсылка, МестоХраненияСсылка, Количество");
	
	// 3. Свертка (суммируем количество по одинаковым аналитикам)
	ТЗ.Свернуть("ТоварСсылка, ХарСсылка, ПартияСсылка, МестоХраненияСсылка", "Количество");
	
	// 4. Создание документа
	ДокОбъект = Документы.ВводНачальныхОстатков.СоздатьДокумент();
	ДокОбъект.Дата = ТекущаяДата();
	// ДокОбъект.Организация = ... (укажите организацию, если требуется)
	
	Для Каждого СтрТЗ Из ТЗ Цикл
		НовСтрока = ДокОбъект.Товары.Добавить();
		НовСтрока.Номенклатура = СтрТЗ.ТоварСсылка;
		НовСтрока.Характеристика = СтрТЗ.ХарСсылка;
		НовСтрока.Партия = СтрТЗ.ПартияСсылка;
		// Если склад указывается в ТЧ:
		// НовСтрока.Склад = СтрТЗ.МестоХраненияСсылка; 
		НовСтрока.Количество = СтрТЗ.Количество;
	КонецЦикла;
	
	Попытка
		// Записываем документ и пытаемся провести
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Возврат ДокОбъект.Ссылка;
	Исключение
		Сообщить("Не удалось провести документ: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокументОстатков(Команда)
	
	Рез = СоздатьДокументыНаСервере();
	Если ЗначениеЗаполнено(Рез) Тогда
		ПоказатьОповещениеПользователя("Успех", , "Создан документ: " + Строка(Рез));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	
	Путь = Объект.ФайлЗагрузки;

    Если Путь = "" Тогда
        Сообщить("Укажите путь к файлу Excel.");
        Возврат;
    КонецЕсли;
    
    Попытка
        // Очищаем существующую таблицу значений
        Реквизит1.Очистить();
        
        // Подключаем Excel
        ExcelApp = Новый COMОбъект("Excel.Application");
        ExcelApp.Visible = Ложь;
        Книга = ExcelApp.Workbooks.Open(Путь);
        Лист = Книга.Worksheets(1);
        
        Строк = Лист.UsedRange.Rows.Count;
        
        Для i = 2 По Строк Цикл // первая строка - заголовки
            НоваяСтрока =         Реквизит1.Добавить();
            
            НоваяСтрока.Номенклатура 	= Лист.Cells(i,1).Value;
            НоваяСтрока.Цвет 			= Лист.Cells(i,2).Value;
            НоваяСтрока.ral 			= Лист.Cells(i,3).Value;
            НоваяСтрока.Партия 			= Лист.Cells(i,4).Value;
            НоваяСтрока.Количество 		= Лист.Cells(i,5).Value;
            НоваяСтрока.Комплект 		= Лист.Cells(i,6).Value;
            НоваяСтрока.Фасовка 		= Лист.Cells(i,7).Value;
			//НоваяСтрока.ВесОтвердителя 	= Лист.Cells(i,8).Value;
            НоваяСтрока.Брак			= Лист.Cells(i,9).Value; 
			НоваяСтрока.Примечание		= Лист.Cells(i,10).Value;
            НоваяСтрока.ВходнойКонтроль = Лист.Cells(i,11).Value;
            НоваяСтрока.Счет			= Лист.Cells(i,12).Value;
            НоваяСтрока.МестоХранения 	= Лист.Cells(i,13).Value;
            НоваяСтрока.Контрагент		= Лист.Cells(i,14).Value;
            НоваяСтрока.Цена 			= Лист.Cells(i,15).Value;
                       
        КонецЦикла;
        
        Книга.Close(Ложь);
        ExcelApp.Quit();
        Книга = Неопределено;
		Лист = Неопределено;
		ExcelApp = Неопределено;
        
        Сообщить("Данные успешно загружены.");
        
    Исключение
        Сообщить("Ошибка при загрузке Excel: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры
